app/views/posts/index.html.erb

        <td class="danger"><%= post.body %></td>
        <td class="success"><%= (post.present? and post.user.present?) ? post.user.email : "Email not available" %></td>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]