app/controllers/posts_controller.rb

  def index
    @posts = (current_user.present? and current_user.posts.present?) ? current_user.posts : []
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 3]]

  def create
    @post = current_user.posts.build(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", ""], ["body", ""], ["created_at", 2017-04-18 08:56:17 UTC], ["updated_at", 2017-04-18 08:56:17 UTC], ["user_id", 1]]